---
kind: property
id: P:Autodesk.Revit.DB.TableCellStyleOverrideOptions.BorderLeftLineStyle
source: html/f722064c-9a6a-ffa6-1225-80ae5a604f8e.htm
---
# Autodesk.Revit.DB.TableCellStyleOverrideOptions.BorderLeftLineStyle Property

Indicates if the border left line style characteristic is overridden.

## Syntax (C#)
```csharp
public bool BorderLeftLineStyle { get; set; }
```